---
kind: property
id: P:Autodesk.Revit.DB.ElementType.Name
source: html/1198805b-fdbf-54bf-64d3-90dbd01b4c5f.htm
---
# Autodesk.Revit.DB.ElementType.Name Property

Set the name for the ElementType.

## Syntax (C#)
```csharp
public override string Name { set; }
```

## Remarks
This method will assign the element type a new name.